Autodesk.Revit.DB.Structure.AnalyticalPanel.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.XYZ)
Creates a new instance of an Analytical Panel within the project.
Remarks:
Profile can be a line, an arc or an ellipse.
In case of arcs and ellipses, the normal should be perpendicular to the profile plane.
document:
Revit document.
profile:
Curve which represents the profile of the Analytical Panel.
normal:
Normal used for the extrusion of the profile.
Returns:
The newly created AnalyticalPanel instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The profile argument is not valid for analytical panel creation.
-or-
The input profile is not bound.
-or-
The normal argument is not valid for analytical panel creation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the analytical panel.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2023.1